app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."provider_id" = $1  [["provider_id", 11]]
---
  def providerId
    puts '------ POST /comments/providerId -------'
    puts 'params[:provider_id] = ' + params[:id].to_s
    @providers = Comment.where(:provider_id => params[:id])

INSERT INTO "comments" ("review", "rank", "created_at", "updated_at", "provider_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["review", "asdfadfafagsfdg"], ["rank", 5], ["created_at", "2017-09-23 13:17:19.290145"], ["updated_at", "2017-09-23 13:17:19.290145"], ["provider_id", 10]]
---
  def create
    puts '--- POST /comments ---'
    puts '--- comment_params --- ' + params.to_s
    @comment = Comment.new(comment_params)

    if @comment.save