app/controllers/providers_controller.rb

  def userId
    puts '------ POST /providers/userId -------'
    puts 'params[:user_id] = ' + params[:id].to_s
    @providers = Provider.where(:user_id => params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."user_id" = $1  [["user_id", 1]]

  def index
    @providers = Provider.all
---
SELECT "providers".* FROM "providers"

  def create
    puts '------------ POST /providers create ---------------'
    # puts 'provider_params = ' + provider_params.to_s
    @provider = Provider.new(provider_params)

    if @provider.save
---
INSERT INTO "providers" ("name", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Linwood"], ["category", "Electrician"], ["user_id", 6], ["created_at", "2017-09-21 19:37:36.814971"], ["updated_at", "2017-09-21 19:37:36.814971"]]

  def update
    if @provider.update(provider_params)
---
UPDATE "providers" SET "name" = $1, "updated_at" = $2 WHERE "providers"."id" = $3  [["name", "Paula Lassiter"], ["updated_at", "2017-09-21 21:28:46.781751"], ["id", 3]]

  def destroy
    puts '**** Destroy this record: ' + @provider.to_s
    puts '**** prams : ' + params.to_s

    @provider.destroy
---
DELETE FROM "providers" WHERE "providers"."id" = $1  [["id", 23]]

    def set_provider
      puts 'SET_PROVIDER PARAMS[:ID] = ' + params[:id].to_s
      @provider = Provider.find(params[:id])
---
SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]