app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Admin"], ["LIMIT", 1]]
---
  def login
    puts '--- LOGIN ---'
    # params.each do |i|
    #   puts i
    # end
    #
    # puts params[:username]
    # puts params[:password]
    # # #
    # puts username: params[:username]
    # puts password: params[:password] #= 'Linwood'
    # puts user = User.find_by(params[:username])
    user = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    #todo: add a white list for only allowing Gizmo users.....
    puts params[:username]
    puts params[:password]
    puts params[:email]

    @user = User.new(username: params[:username], password: params[:password], email: params[:email]) #provider_id: params[:provider_id]
    if @user.save